Revit 2026 API

# PhaseFilterCreate Method

---

Creates a new phase filter with default status presentation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static PhaseFilter Create(
	Document document,
	string name
)
```
```vb
Public Shared Function Create (
	document As Document,
	name As String
) As PhaseFilter
```
```cpp
public:
static PhaseFilter^ Create(
	Document^ document,
	String^ name
)
```
```fsharp
static member Create :
        document : Document *
        name : string -> PhaseFilter
```

#### Parameters

document Document
     The document.
name String
     The name.

#### Return Value

PhaseFilter The newly created phase filter.

| Exception | Condition |
| --- | --- |
| ArgumentException | name is already in use. |
| ArgumentNullException | A non-optional argument was null |

The default status presentation is ShowByCategory for New status, and ShowOverriden for Existing, Demolished and Temporary statuses.

#### Reference

PhaseFilter Class

Autodesk.Revit.DB Namespace